index.org
#+TITLE: A Semi-Quick Introduction To Emacs
* why emacs is worth the bother
Emacs has a few unusual properties which work together really well, making for a super powerful,
flexible system that's easier to bend to your will in sophisticated ways than almost anything
else around. That might sound a little intimidating, but most day-to-day emacs usage isn't
reinventing the world; but when you want to do something custom, the power is right at your
fingertips. Literally.

What are those properties? Well:

1) Emacs is configured with a full-fledged, high-level programming language, with functions, control
   flow, etc. Emacs lisp is a dynamic functional language; the syntax is out of the ordinary, but
   under the hood, it's a little like old-school javascript with an emphasis on linked lists,
   strings, and text buffers. Except for macros, which are powerful like magic, only less...
   magical.

2) Literally everything you can do in emacs, including really basic stuff like "move the cursor
  forwards 15 characters" and "insert the text ~function fo() { return "haha this was not named foo" }~" can be
  scripted with emacs lisp. Here:
  #+BEGIN_SRC emacs-lisp
  (forward-char 15)
  (insert "function fo() { return \"haha this was not named foo\" }")
  #+END_SRC

3) Literally every user interaction follows the same model: you hit a key (or equivalent, like
   clicking the mouse), which triggers some lisp function.

4) You can look up, at any time you want, the name of the function bound to any key; the full
   documentation for any function (with a hyperlink to its source code, so you can dig as deep as
   you want); and the value of any variable. Just type =C-h= and then one of =k=, =f=, or =v= (guess which
   is which). (There are lots more help options under that =C-h= prefix, too.)

5) Literally any keystroke and combination can be bound to any function you want.

I know I used "literally" a lot in there, but lots of programs make sweeping "[verb] any
[noun]!"-type claims that are only /mostly/ true.

Anyway, once you internalize the logic of this system, you have superpowers! Did something weird
just happen? Type =C-h k=, then hit the same keystroke again to find out what function is responsible.
Want to change what that keystroke does? You can, on the fly. You always open the same file, so you
want a shortcut? That's like a 30s customization, once you're used to emacs. Want to do something
fancy, but you don't know what the right function is named? Just search all the functions that exist
by name, to see if one sounds right, then read its documentation to be sure.

Emacs has a lot of janky and/or bullshit characteristics, due to its long history and occasionally
just due to the intransigence of the neckbeards who run the project. But no emacs user is beholden
to those neckbeards: if you don't like it, you can change it. Or better yet, you can find someone
else who already changed it the way you want and put that shit on github.
* seriously, before you get started: remap caps lock to control
Caps lock is useless. Control is /constantly/ used in emacs. As a bonus, lots of standard emacs
shortcuts for text navigation (=C-a= to jump to start of line; =C-e= to jump to end of line; =C-k= to
delete from the cursor to the end of text or the next newline, whichever comes first; =C-t= to
"transpose" two characters when you make a tyop; =C-n= and =C-p= to go down/up one line) work in the
shell and in almost all OSX text fields. If control is where caps lock was, all this is right on
home row, super easy and ergonomic to use. If not, you sort of end up making weird claw hands all
the time.
* okay, with that out of the way: quick start
Lots of people will tell you that stock emacs sucks. That is because stock emacs kind of sucks. We
can do better than that.
** Install a version of emacs that isn't awful
 If you're on a mac, there is an ~emacs~ pre-installed, but it's like 10 years out of date and only
 works in the terminal. It's good for one thing:

#+BEGIN_SRC shell
  # haha, good luck figuring out how to close emacs
  emacs -q --no-splash -f tetris
#+END_SRC
Tetris? Remember, you can rebind any keystroke to run your own code, and emacs will do any song and
dance you're clever/patient enough to write. Web browsers were originally just for viewing
documents, too.

For your non-tetris needs, you'll want to do one of these
 #+BEGIN_SRC shell
   # good, but ought to be better
   brew install emacs

   # much better, unless connecting to your running emacs from the terminal is important to you
   # (and if it is, you probably don't need introductory notes?)
   brew tap railwaycat/emacsmacport
   brew install emacs-mac
 #+END_SRC

 Why is the normal emacs not the best choice for mac? Because the Free Software Foundation people are
 assholes about everything but linux. Sorry, "GNU/linux". So some guy forked emacs so he could add
 e.g. native OSX smooth scrolling and shit.
** Install a starter kit
These have gotten popular these days. Basically, these are community-maintained configurations on
top of emacs. They add in useful third-party libraries (in some cases, so useful they have become de
facto standards), update the styling so emacs looks like it's from the present, instead of the
mid-90s, and usually offer a bunch of variables you can tweak to easily toggle features and stuff.
They're generally intended to be a more powerful and beautiful "batteries included" starting point
for people. To install a starter kit, just clone the project repository to =~/.emacs.d=; when you next
start emacs, it will automatically load that code.
*** If you like piña coladas, and getting stuck in a vim session
My favorite is Spacemacs (http://spacemacs.org/). It's also probably the most popular, and
therefore the best supported, with the most stack overflow answers a quick google away. Spacemacs
is written by and for people who like vim's command language (which is an insanely good fit for
emacs' keybinding model, actually), but you don't need to use it in a vimmy way. Most people do,
because it's insanely good like that, but you do you. Spacemacs has a wonderful system of mnemonic
commands that you access via a universal prefix key, which is the space bar if you use vim
keybindings and something else if you don't. I'd honestly recommend spacemacs even if you choose
not to use vim bindings at all.
