index.html
<!doctype html>
<html lang="en">
<head>
<title>A Semi-Quick Introduction To Emacs</title>
<!-- 2019-09-10 Tue 00:25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Alex Birdsall">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">A Semi-Quick Introduction To Emacs</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> why emacs is worth the bother</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs has a few unusual properties which work together really well, making for a super powerful,
flexible system that's easier to bend to your will in sophisticated ways than almost anything
else around. That might sound a little intimidating, but most day-to-day emacs usage isn't
reinventing the world; but when you want to do something custom, the power is right at your
fingertips. Literally.
</p>

<p>
What are those properties? Well:
</p>

<ol class="org-ol">
<li>Emacs is configured with a full-fledged, high-level programming language, with functions, control
flow, etc. Emacs lisp is a dynamic functional language; the syntax is out of the ordinary, but
under the hood, it's a little like old-school javascript with an emphasis on linked lists,
strings, and text buffers. Except for macros, which are powerful like magic, only less&#x2026;
magical.
</li>

<li>Literally everything you can do in emacs, including really basic stuff like "move the cursor
forwards 15 characters" and "insert the text <code>function fo() { return "haha this was not named foo" }</code>" can be
scripted with emacs lisp. Here:
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>forward-char <span style="color: #da8548; font-weight: bold;">15</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>insert <span style="color: #98be65;">"function fo() { return \"haha this was not named foo\" }"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</li>

<li>Literally every user interaction follows the same model: you hit a key (or equivalent, like
clicking the mouse), which triggers some lisp function.
</li>

<li>You can look up, at any time you want, the name of the function bound to any key; the full
documentation for any function (with a hyperlink to its source code, so you can dig as deep as
you want); and the value of any variable. Just type <code>C-h</code> and then one of <code>k</code>, <code>f</code>, or <code>v</code> (guess which
is which). (There are lots more help options under that <code>C-h</code> prefix, too.)
</li>

<li>Literally any keystroke and combination can be bound to any function you want.
</li>
</ol>

<p>
I know I used "literally" a lot in there, but lots of programs make sweeping "[verb] any
[noun]!"-type claims that are only <i>mostly</i> true.
</p>

<p>
Anyway, once you internalize the logic of this system, you have superpowers! Did something weird
just happen? Type <code>C-h k</code>, then hit the same keystroke again to find out what function is responsible.
Want to change what that keystroke does? You can, on the fly. You always open the same file, so you
want a shortcut? That's like a 30s customization, once you're used to emacs. Want to do something
fancy, but you don't know what the right function is named? Just search all the functions that exist
by name, to see if one sounds right, then read its documentation to be sure.
</p>

<p>
Emacs has a lot of janky and/or bullshit characteristics, due to its long history and occasionally
just due to the intransigence of the neckbeards who run the project. But no emacs user is beholden
to those neckbeards: if you don't like it, you can change it. Or better yet, you can find someone
else who already changed it the way you want and put that shit on github.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> seriously, before you get started: remap caps lock to control</h2>
<div class="outline-text-2" id="text-2">
<p>
Caps lock is useless. Control is <i>constantly</i> used in emacs. As a bonus, lots of standard emacs
shortcuts for text navigation (<code>C-a</code> to jump to start of line; <code>C-e</code> to jump to end of line; <code>C-k</code> to
delete from the cursor to the end of text or the next newline, whichever comes first; <code>C-t</code> to
"transpose" two characters when you make a tyop; <code>C-n</code> and <code>C-p</code> to go down/up one line) work in the
shell and in almost all OSX text fields. If control is where caps lock was, all this is right on
home row, super easy and ergonomic to use. If not, you sort of end up making weird claw hands all
the time.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> okay, with that out of the way: quick start</h2>
<div class="outline-text-2" id="text-3">
<p>
Lots of people will tell you that stock emacs sucks. That is because stock emacs kind of sucks. We
can do better than that.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Install a version of emacs that isn't awful</h3>
<div class="outline-text-3" id="text-3-1">
<p>
If you're on a mac, there is an <code>emacs</code> pre-installed, but it's like 10 years out of date and only
works in the terminal. It's good for one thing:
</p>

<div class="org-src-container">

<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">haha, good luck figuring out how to close emacs</span>
emacs -q --no-splash -f tetris
</pre>
</div>
<p>
Tetris? Remember, you can rebind any keystroke to run your own code, and emacs will do any song and
dance you're clever/patient enough to write. Web browsers were originally just for viewing
documents, too.
</p>

<p>
For your non-tetris needs, you'll want to do one of these
</p>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">good, but ought to be better</span>
brew install emacs

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">much better, unless connecting to your running emacs from the terminal is important to you</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">(and if it is, you probably don't need introductory notes?)</span>
brew tap railwaycat/emacsmacport
brew install emacs-mac
</pre>
</div>

<p>
Why is the normal emacs not the best choice for mac? Because the Free Software Foundation people are
assholes about everything but linux. Sorry, "GNU/linux". So some guy forked emacs so he could add
e.g. native OSX smooth scrolling and shit.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Install a starter kit</h3>
<div class="outline-text-3" id="text-3-2">
<p>
These have gotten popular these days. Basically, these are community-maintained configurations on
top of emacs. They add in useful third-party libraries (in some cases, so useful they have become de
facto standards), update the styling so emacs looks like it's from the present, instead of the
mid-90s, and usually offer a bunch of variables you can tweak to easily toggle features and stuff.
They're generally intended to be a more powerful and beautiful "batteries included" starting point
for people. To install a starter kit, just clone the project repository to <code>~/.emacs.d</code>; when you next
start emacs, it will automatically load that code.
</p>
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> If you like piña coladas, and getting stuck in a vim session</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
My favorite is Spacemacs (<a href="http://spacemacs.org/">http://spacemacs.org/</a>). It's also probably the most popular, and
therefore the best supported, with the most stack overflow answers a quick google away. Spacemacs
is written by and for people who like vim's command language (which is an insanely good fit for
emacs' keybinding model, actually), but you don't need to use it in a vimmy way. Most people do,
because it's insanely good like that, but you do you. Spacemacs has a wonderful system of mnemonic
commands that you access via a universal prefix key, which is the space bar if you use vim
keybindings and something else if you don't. I'd honestly recommend spacemacs even if you choose
not to use vim bindings at all.
</p>
</div>
</div>
