index.org
*** If you want something more traditionally emacsy, because you don't give a fuck about vim
A venerable starter kit that's a bit more mainline emacs is Prelude
(https://github.com/bbatsov/prelude). I haven't used it, so I can't comment on it much, but I've
heard very good things, and its primary maintainer is pretty legit.
*** If you want to be FANCY
A new one is Centaur (https://github.com/seagle0128/.emacs.d). Centaur is very pretty and into
normal modern UI stuff like file trees with icons and tabs and stuff.

Oh yeah, emacs doesn't really even have decent tab support? Centaur tabs are clever, but a hack. I
dunno, y'all, nothing's perfect.

Cool, you have a modern version of emacs, and now it looks adequate. Let's get oriented.
** A quick tour of essential emacs keybindings
You can remap any key in any mode, but the defaults are around until and unless you change them, so
they're worth knowing. I'm assuming you didn't install spacemacs in vim mode; if you did, a few
parts of this won't generally apply.

By convention, emacs documents keystrokes (in all of its documentation and when reporting what keys
a function is bound to) a certain way. I've already used it above. Here's a more complicated
keybinding:
#+begin_quote
=C-x c=
#+end_quote
This means "hold control and type x; then type c". You never hit control except in combination with
other keys, so the "c" character is unambiguous in both spots there. In keybinding notation, dashes
mean "hit these two keys together" and spaces mean "after typing key X, release the keys and then
type key Y".

Two modifier keys are king in emacs: control, which is the control key, and meta, which is the alt
key. It's weird, but emacs literally predates the alt key being standard. Meta is =M-[something]= in
keybinding notation.

If you're a hipster like me, you might switch things up so that the mac command key is meta
instead of alt. Emacs is what you make it.

*** First command to learn: =M-x= lets you run commands by name
A decent starter configuration will give you a nice fuzzy search interface when you hit =M-x=. Start
typing, and when the command you want comes up in the results, you can use the arrow keys and enter
to execute that command. Don't remember the keybinding for some functionality? Hit =M-x= and start
typing its name. Since keyboard space is finite, some commands can only be run like this. For
example, =M-x snake= starts a game of snake, and =M-x doctor= starts a psychotherapy session with
everyone's favorite 1960s chatbot ELIZA.

*** First commands to learn: what to do when you panic
=C-x C-c= 

Within a session, if emacs freezes, or starts acting weird, or you mistype and find yourself halfway
into the wrong key sequence, start spamming =C-g= to cancel out of whatever the current thing is. The
downside to letting people run their own code is that sometimes they write dumb code and have stuff
like infinite loops. In cases like this, =C-g= is your friend. You can also spam the escape key: on
the rare occasion =C-g= doesn't work, three escapes usually will.

*** There's a method to the madness
Really quick commands you will do while you type code/prose/emails/whatever are bound to control
[something] or meta [something], so you can just bust them out quickly. Commands that are common but
that you're less likely to use in quick succession, like saving, managing your windows, quitting
emacs, etc, are under the =C-x= prefix (the "x" is for "execute command": Emacs tries to make stuff
mnemonic). Commands that are less common than that (or when you remember the name but not the
keybinding), you can type =M-x= and find them by name. The similarity of the two "execute command"
keybindings, =C-x= and =M-x,= is not a coincidence. Mnemonic, remember?

That's a decent intro to the standardish sort-of-hierarchy for what different modifier keys mean
with the same key. =C-f= goes forwards one character; =M-f= goes forwards one word; =C-M-f= goes
forward one semantic unit (paired quotes or braces, a code block, or whatever: different language
modes can define what a semantic unit is, and emacs has some more-or-less sensible global defaults).
When "same thing, but with a wider scope" doesn't make sense, sometimes control and meta do opposite
versions of the same thing. I don't want to bog you down with examples, though: you can get by for a
while using arrow keys, the mouse, and a small handful of memorized commands.

The file menu is a nice way to find commands at first, too, though you'll probably leave it behind
as you internalize a more keyboard-driven workflow.
** what is a mode, even
Modes are how emacs lets you apply or remove related configurations and keybindings en masse.
Functions that manipulate ruby code only make sense if you're editing a ruby file; so those
keybindings only apply when ~ruby-mode~ is active. ~ruby-mode~ is a /major/ mode.

Every buffer has one (1) major mode. This says what kind of thing that buffer is. Is it a file of
some programming language? Each programming language has its own major mode (sometimes you even have
a couple options, because open source). Is the buffer an interactive feature, like a game of tetris
or a git dashboard? Is it some elisp function's documentation? That's the major mode. You can use
=M-x= to change the major mode (they're just functions, under the hood), and interact with the buffer
contents in a different way, but you almost never have to.

You can only have one major mode per buffer, but you can have as many minor modes as you want.
Minor modes tend to wrap a few related functions and settings into some feature, so you can easily
toggle the feature by (de)activating the minor mode. Autocomplete is a minor mode. Spell-check is a
minor mode. [[https://elpa.gnu.org/packages/rainbow-mode.html][rainbow-mode]] is a minor mode, and makes writing CSS so much nicer. A [[https://github.com/TeMPOraL/nyan-mode][nyan cat status bar]]
to tell you how far into a buffer you are? Minor mode. Most features are implemented as minor modes.

