index.html
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> If you want something more traditionally emacsy, because you don't give a fuck about vim</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
A venerable starter kit that's a bit more mainline emacs is Prelude
(<a href="https://github.com/bbatsov/prelude">https://github.com/bbatsov/prelude</a>). I haven't used it, so I can't comment on it much, but I've
heard very good things, and its primary maintainer is pretty legit.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> If you want to be FANCY</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
A new one is Centaur (<a href="https://github.com/seagle0128/.emacs.d">https://github.com/seagle0128/.emacs.d</a>). Centaur is very pretty and into
normal modern UI stuff like file trees with icons and tabs and stuff.
</p>

<p>
Oh yeah, emacs doesn't really even have decent tab support? Centaur tabs are clever, but a hack. I
dunno, y'all, nothing's perfect.
</p>

<p>
Cool, you have a modern version of emacs, and now it looks adequate. Let's get oriented.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> A quick tour of essential emacs keybindings</h3>
<div class="outline-text-3" id="text-3-3">
<p>
You can remap any key in any mode, but the defaults are around until and unless you change them, so
they're worth knowing. I'm assuming you didn't install spacemacs in vim mode; if you did, a few
parts of this won't generally apply.
</p>

<p>
By convention, emacs documents keystrokes (in all of its documentation and when reporting what keys
a function is bound to) a certain way. I've already used it above. Here's a more complicated
keybinding:
</p>
<blockquote>
<p>
<code>C-x c</code>
</p>
</blockquote>
<p>
This means "hold control and type x; then type c". You never hit control except in combination with
other keys, so the "c" character is unambiguous in both spots there. In keybinding notation, dashes
mean "hit these two keys together" and spaces mean "after typing key X, release the keys and then
type key Y".
</p>

<p>
Two modifier keys are king in emacs: control, which is the control key, and meta, which is the alt
key. It's weird, but emacs literally predates the alt key being standard. Meta is <code>M-[something]</code> in
keybinding notation.
</p>

<p>
If you're a hipster like me, you might switch things up so that the mac command key is meta
instead of alt. Emacs is what you make it.
</p>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> First command to learn: <code>M-x</code> lets you run commands by name</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
A decent starter configuration will give you a nice fuzzy search interface when you hit <code>M-x</code>. Start
typing, and when the command you want comes up in the results, you can use the arrow keys and enter
to execute that command. Don't remember the keybinding for some functionality? Hit <code>M-x</code> and start
typing its name. Since keyboard space is finite, some commands can only be run like this. For
example, <code>M-x snake</code> starts a game of snake, and <code>M-x doctor</code> starts a psychotherapy session with
everyone's favorite 1960s chatbot ELIZA.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> First commands to learn: what to do when you panic</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
<code>C-x C-c</code> 
</p>

<p>
Within a session, if emacs freezes, or starts acting weird, or you mistype and find yourself halfway
into the wrong key sequence, start spamming <code>C-g</code> to cancel out of whatever the current thing is. The
downside to letting people run their own code is that sometimes they write dumb code and have stuff
like infinite loops. In cases like this, <code>C-g</code> is your friend. You can also spam the escape key: on
the rare occasion <code>C-g</code> doesn't work, three escapes usually will.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> There's a method to the madness</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Really quick commands you will do while you type code/prose/emails/whatever are bound to control
[something] or meta [something], so you can just bust them out quickly. Commands that are common but
that you're less likely to use in quick succession, like saving, managing your windows, quitting
emacs, etc, are under the <code>C-x</code> prefix (the "x" is for "execute command": Emacs tries to make stuff
mnemonic). Commands that are less common than that (or when you remember the name but not the
keybinding), you can type <code>M-x</code> and find them by name. The similarity of the two "execute command"
keybindings, <code>C-x</code> and <code>M-x,</code> is not a coincidence. Mnemonic, remember?
</p>

<p>
That's a decent intro to the standardish sort-of-hierarchy for what different modifier keys mean
with the same key. <code>C-f</code> goes forwards one character; <code>M-f</code> goes forwards one word; <code>C-M-f</code> goes
forward one semantic unit (paired quotes or braces, a code block, or whatever: different language
modes can define what a semantic unit is, and emacs has some more-or-less sensible global defaults).
When "same thing, but with a wider scope" doesn't make sense, sometimes control and meta do opposite
versions of the same thing. I don't want to bog you down with examples, though: you can get by for a
while using arrow keys, the mouse, and a small handful of memorized commands.
</p>

<p>
The file menu is a nice way to find commands at first, too, though you'll probably leave it behind
as you internalize a more keyboard-driven workflow.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> what is a mode, even</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Modes are how emacs lets you apply or remove related configurations and keybindings en masse.
Functions that manipulate ruby code only make sense if you're editing a ruby file; so those
keybindings only apply when <code>ruby-mode</code> is active. <code>ruby-mode</code> is a <i>major</i> mode.
</p>

<p>
Every buffer has one (1) major mode. This says what kind of thing that buffer is. Is it a file of
some programming language? Each programming language has its own major mode (sometimes you even have
a couple options, because open source). Is the buffer an interactive feature, like a game of tetris
or a git dashboard? Is it some elisp function's documentation? That's the major mode. You can use
<code>M-x</code> to change the major mode (they're just functions, under the hood), and interact with the buffer
contents in a different way, but you almost never have to.
</p>

<p>
You can only have one major mode per buffer, but you can have as many minor modes as you want.
Minor modes tend to wrap a few related functions and settings into some feature, so you can easily
toggle the feature by (de)activating the minor mode. Autocomplete is a minor mode. Spell-check is a
minor mode. <a href="https://elpa.gnu.org/packages/rainbow-mode.html">rainbow-mode</a> is a minor mode, and makes writing CSS so much nicer. A <a href="https://github.com/TeMPOraL/nyan-mode">nyan cat status bar</a>
to tell you how far into a buffer you are? Minor mode. Most features are implemented as minor modes.
</p>
</div>
</div>
